app/Services/PembayaranService.php

        }

        // Cek apakah pembayaran ini adalah perpanjangan sewa (sudah ada pembayaran terverifikasi sebelumnya)
        $hasPreviousVerified = Pembayaran::where('penghuni_kamar_id', $pembayaran->penghuni_kamar_id)
            ->where('status', 'terverifikasi')
            ->where('id', '!=', $pembayaran->id)
            ->exists();
---
select * from `pembayaran` where `penghuni_kamar_id` = 8 and `status` in ('pending', 'terverifikasi') limit 1