app/Http/Controllers/Penghuni/PenghuniDashboardController.php

    public function index()
    {
        // Real-time check and notify overdue leases (1x per lease)
        $this->penghuniKamarService->periksaDanKirimNotifikasiJatuhTempo();

        /** @var User $user */
        $user = Auth::user();
        $penghuniKamar = $user->penghuniKamar()->with(['kamar.kos', 'pembayaran'])->where('status', 'aktif')->first();
---
select * from `penghuni_kamar` where `penghuni_kamar`.`penghuni_id` = 16 and `penghuni_kamar`.`penghuni_id` is not null and `status` = 'aktif' limit 1

    public function aturan()
    {
        /** @var User $user */
        $user = Auth::user();
        $penghuniKamar = $user->penghuniKamar()->with(['kamar.kos'])->where('status', 'aktif')->first();
---
select * from `penghuni_kamar` where `penghuni_kamar`.`penghuni_id` = 16 and `penghuni_kamar`.`penghuni_id` is not null and `status` = 'aktif' limit 1

    public function pembayaran()
    {
        /** @var User $user */
        $user = Auth::user();
        $penghuniKamar = $user->penghuniKamar()->with(['kamar.kos', 'pembayaran'])->where('status', 'aktif')->first();
---
select * from `penghuni_kamar` where `penghuni_kamar`.`penghuni_id` = 16 and `penghuni_kamar`.`penghuni_id` is not null and `status` = 'aktif' limit 1

        $roommateHalfName = '';

        if ($isKamarBerbagi) {
            $roommatePks = \App\Models\PenghuniKamar::where('kamar_id', $kamar->id)
                ->where('status', 'aktif')
                ->where('id', '!=', $penghuniKamar->id)
                ->with('penghuni')
                ->get();
---
select * from `penghuni_kamar` where `penghuni_kamar`.`penghuni_id` = 16 and `penghuni_kamar`.`penghuni_id` is not null and `status` = 'aktif' limit 1