app/Http/Controllers/SuperAdmin/SuperAdminDashboardController.php

select * from `kantor` order by `created_at` desc
---
    public function kantorIndex()
    {
        $kantors = Kantor::latest()->get();

insert into `kantor` (`nama`, `alamat`, `latitude`, `longitude`, `no_telp`, `updated_at`, `created_at`) values ('Seven Inc (Kantor Pusat)', 'Jl. Raya Janti Gg. Harjuna No.59, Jaranan, Karangjambe, Kec. Banguntapan, Kabupaten Bantul, Daerah Istimewa Yogyakarta 55198', '-7.790374101746214', '110.40936692829567', '089633040200', '2026-08-18 07:26:29', '2026-08-18 07:26:29')
---
    public function kantorStore(Request $request)
    {
        $validated = $request->validate([
            'nama' => 'required|string|max:100',
            'alamat' => 'nullable|string',
            'latitude' => 'required|numeric',
            'longitude' => 'required|numeric',
            'no_telp' => 'nullable|string|max:30',
        ]);

        Kantor::create($validated);

select * from `kantor` where `kantor`.`id` = 3 limit 1
delete from `kantor` where `id` = 3
---
    public function kantorDestroy(int $id)
    {
        $kantor = Kantor::findOrFail($id);
        $kantor->delete();