app/Http/Controllers/NotifikasiController.php

select * from `penghuni_kamar` where `penghuni_kamar`.`penghuni_id` = 16 and `penghuni_kamar`.`penghuni_id` is not null and `status` = 'aktif' limit 1
---
    public function index()
    {
        /** @var \App\Models\User $user */
        $user = Auth::user();
        $notifikasis = $this->service->getByUser($user->id);

        $userKosId = null;
        $userKamarId = null;

        if ($user->role === 'penghuni') {
            $activePk = $user->penghuniKamar()->with('kamar')->where('status', 'aktif')->first();