app/Http/Controllers/Admin/AdminAturanController.php

    public function index()
    {
        $kosList = Kos::where(function ($q) {
            $q->whereNull('mitra_id')->orWhereHas('mitra', fn($m) => $m->where('is_pro', false));
        })->with(['aturanKos' => function ($q) {
            $q->latest();
        }])->latest()->get();
---
select * from `aturan_kos` order by `created_at` desc