app/Http/Controllers/Admin/AdminMapController.php

    public function index()
    {
        $locations = $this->kosService->getAllLocations();
        $kantors = Kantor::where('is_active', true)->get();
---
select * from `kantor` where `is_active` = 1