app/Repositories/KamarRepository.php

select * from `penghuni_kamar` where `penghuni_kamar`.`kamar_id` in (1, 2, 4, 6, 9, 10, 11, 12, 18, 20, 21, 26, 27)
---
    public function getByKos(int $kosId): Collection
    {
        return $this->model->where('kos_id', $kosId)->with(['kos.mitra', 'penghuniKamar.penghuni'])->latest()->get();

select * from `kamar` where `status` = 'terisi' order by `created_at` desc
select * from `penghuni_kamar` where `penghuni_kamar`.`kamar_id` in (3, 5, 7, 8, 13, 14, 15, 16, 17, 19, 22, 23, 24, 25, 28, 29)
---
    public function getKosong(): Collection
    {
        return $this->model->where('status', 'kosong')
            ->whereHas('kos', function ($q) {
                $q->whereNull('mitra_id')->orWhereHas('mitra', fn($m) => $m->where('is_pro', false));
            })
            ->with(['kos.mitra', 'penghuniKamar.penghuni'])
            ->latest()
            ->get();