app/Repositories/KosRepository.php

select * from `aturan_kos` where `aturan_kos`.`kos_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15)
select * from `kamar` where `kamar`.`kos_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15)
select * from `penghuni_kamar` where `penghuni_kamar`.`kamar_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29)
---
    public function getWithKamar(): Collection
    {
        return $this->model->with(['mitra', 'kamar.penghuniKamar.penghuni', 'aturanKos'])->latest()->get();

select * from `aturan_kos` where `aturan_kos`.`kos_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15)
select * from `penghuni_kamar` where `penghuni_kamar`.`kamar_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29)
select `kos`.*, (select count(*) from `kamar` where `kos`.`id` = `kamar`.`kos_id`) as `total_kamar`, (select count(*) from `kamar` where `kos`.`id` = `kamar`.`kos_id` and `status` = 'terisi') as `kamar_terisi` from `kos` order by `created_at` desc
---
    public function getWithKamarCount(): Collection
    {
        return $this->model->with(['mitra', 'kamar.penghuniKamar.penghuni', 'aturanKos'])->withCount(['kamar as total_kamar', 'kamar as kamar_terisi' => function ($q) {
            $q->where('status', 'terisi');
        }])->latest()->get();