app/Repositories/PembayaranRepository.php

    public function getByPenghuniKamar(int $penghuniKamarId): Collection
    {
        return $this->model->where('penghuni_kamar_id', $penghuniKamarId)
            ->with(['penghuniKamar.kamar'])
            ->latest()
            ->get();
---
select * from `kamar` where `kamar`.`id` in (7, 8, 14, 17, 23)
select * from `penghuni_kamar` where `penghuni_kamar`.`id` in (1, 2, 3, 4, 6, 7, 12, 14, 15)

    public function getPending(): Collection
    {
        return $this->model->where('status', 'pending')
            ->whereNotNull('bukti_transfer_url')
            ->where('bukti_transfer_url', '!=', '')
            ->whereHas('penghuniKamar.kamar.kos', function ($q) {
                $q->whereNull('mitra_id')
                  ->orWhereHas('mitra', fn($m) => $m->where('is_pro', false));
            })
            ->with($this->defaultWith)
            ->latest()
            ->get();
---
select * from `kamar` where `kamar`.`id` in (8, 14, 15, 19)
select * from `penghuni_kamar` where `penghuni_kamar`.`id` in (3, 4, 6, 8, 9, 13)

    public function getTerverifikasi(): Collection
    {
        return $this->model->where('status', 'terverifikasi')
            ->whereHas('penghuniKamar.kamar.kos', function ($q) {
                $q->whereNull('mitra_id')
                  ->orWhereHas('mitra', fn($m) => $m->where('is_pro', false));
            })
            ->with($this->defaultWith)
            ->latest()
            ->get();
---
select * from `kamar` where `kamar`.`id` in (7, 13, 15, 16, 23)
select * from `penghuni_kamar` where `penghuni_kamar`.`id` in (2, 5, 8, 9, 10, 11, 14)