app/Repositories/PenghuniKamarRepository.php

select * from `kamar` where `kamar`.`id` in (7, 8, 13, 14, 15, 16, 17, 19, 23)
select * from `pembayaran` where `pembayaran`.`penghuni_kamar_id` in (1, 2, 3, 4, 5, 6, 7, 9, 10, 11, 12, 13, 14, 15)
---
    public function getAktif(): Collection
    {
        return $this->model->where('status', 'aktif')
            ->whereHas('kamar.kos', function ($q) {
                $q->whereNull('mitra_id')
                  ->orWhereHas('mitra', fn($m) => $m->where('is_pro', false));
            })
            ->with(['kamar.kos', 'penghuni', 'pembayaran'])
            ->latest()
            ->get();

select * from `kamar` where `kamar`.`id` in (15)
select * from `pembayaran` where `pembayaran`.`penghuni_kamar_id` in (8)
---
    public function getByPenghuni(int $penghuniId): ?PenghuniKamar
    {
        return $this->model->where('penghuni_id', $penghuniId)
            ->where('status', 'aktif')
            ->with(['kamar.kos', 'pembayaran'])
            ->first();

select * from `kamar` where `kamar`.`id` in (7, 13, 14, 15, 16, 19, 23)
---
    public function getSelesai(): Collection
    {
        return $this->model->where('status', 'selesai')
            ->with(['penghuni', 'kamar.kos', 'pembayaran'])
            ->latest()
            ->get();

select * from `kamar` where `kamar`.`id` in (7, 13, 14, 16, 19, 23)
---
    public function getExpired(): Collection
    {
        $cutoffDate = now()->hour >= 14 ? now()->toDateString() : now()->subDay()->toDateString();

        return $this->model->where('status', 'aktif')
            ->where('tanggal_keluar', '<=', $cutoffDate)
            ->whereHas('kamar.kos', function ($q) {
                $q->whereNull('mitra_id')
                  ->orWhereHas('mitra', fn($m) => $m->where('is_pro', false));
            })
            ->with(['kamar.kos', 'penghuni'])
            ->get();